БухЭксп/Catalogs/CW_ТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТранспортныеСредства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШасси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТопливо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВодитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПрицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принадлежность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РегистрацонныеЗнакиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РегистрацонныеЗнакиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак_Произвольный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_РолиСотрудниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_РолиСотрудниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РолиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗначенияПоказателейНормРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияПоказателейНормРасходаТоплива</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательРасчетаРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПоказателиРасчетаРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СостоянияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СостоянияТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ПробегТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ПробегТС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегПорожний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегСГрузом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ТопливоТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ТопливоТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Топливо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрТранпортногоСредства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДополнительноеОборудованиеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДополнительноеОборудованиеТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормулаРасчетаНормыРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФормулыРасчетаНормыРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТранспортныеСредства/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте 
Перем ИндексСтроки;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяБлокСобственногоТранспорта 						= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта");
	ПрименяютсяНормативыРасходаТоплива 							= ПолучитьФункциональнуюОпцию("CW_ПрименяютсяНормативыРасходаТоплива");
	ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели = ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели");
	ИспользуетсяДополнительноеОборудование						= ПолучитьФункциональнуюОпцию("CW_ИспользуетсяДополнительноеОборудованиеТранспортныхСредств");
	
	УстанавливатьОтборПрицепаПоВладельцу = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"УстанавливатьОтборПрицепаПоВладельцу");
	
	ОсновнойТипДляТягача 			= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ОсновнойТипТранспортногоСредстваДляТягача");
	ОсновнойТипДляПрицепа 			= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ОсновнойТипТранспортногоСредстваДляПрицепа");
	ОсновнойТипДляДопОборудования 	= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ОсновнойТипТранспортногоСредстваДляДополнительногоОборудования");
	
	Если ИспользуетсяДополнительноеОборудование тогда
		Элементы.ВидТС.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ДополнительноеОборудование"));
	КонецЕсли;
	
	Если ИспользуетсяБлокСобственногоТранспорта Тогда
		Элементы.Принадлежность.СписокВыбора.Добавить(2, "Собственное");
	КонецЕсли;

	ДокументыТС_ПоказыватьНеАктуальные 	= Ложь;
	ОтображатьВсеПоказатели 			= истина;
	
	ОбработатьОтображениеКнопкиАкутальныхДокументов();
	
	_ОтборПараметров();
	
	CW_ПраваДоступа.УстановитьПраваДляФормы(ЭтаФорма);
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	_НачальноеЗаполнение();
	
	ЗаполнитьТаблицуХарактеристикМодели();
	
	_УправлениеЭлементамиФормы();
	
	_СписокВыбораОсновногоТоплива();
	
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ОбновитьДанныеРегистрационногоНомера();
	КонецЕсли;
	
	Элементы.НадписьПоказатьИсторию.Видимость = Не Параметры.Ключ.Пустая();
	
	ОбработатьВидимостьЭлементовПоПринадлежностиТС();
	
	ОбновитьПодсказкуТоплива();

	РедактироватьНаименованиеПриИзмененииНаСервере();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодсказкуТоплива()
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("Выбор вида топлив ограничен настройками "));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("модели",,,,ПолучитьНавигационнуюСсылку(Объект.Модель)));
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(" транспортного средства"));
	
	Элементы.Топливо.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры  

&НаКлиенте
Процедура РедактироватьНаименованиеПриИзменении(Элемент)
	РедактироватьНаименованиеПриИзмененииНаСервере(); 
	РегистрационныйЗнакПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РедактироватьНаименованиеПриИзмененииНаСервере()
	Элементы.Наименование.Доступность = Объект.РедактироватьНаименование;
КонецПроцедуры



&НаСервере
Процедура ОбновитьОтображениеКнопки()
	
	Элементы.ПоказателиНормРасходаТопливаПоказатьВсеПоказатели.Пометка = Не ОтображатьВсеПоказатели;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользуетсяБлокСобственногоТранспорта тогда
		_ОтборПараметров();
	КонецЕсли;
	
	Если РегистрационныйЗнак_Изменен 
		или РегистрационныйЗнак_Произвольный_Изменен
		или РегистрационныйЗнак_Номер_Изменен 
		Или РегистрационныйЗнак_Регион_Изменен Тогда
		
		Если  РегистрационныйЗнак_Произвольный Тогда
			РегистрационныйЗнак_Номер 	= "";
			РегистрационныйЗнак_Регион 	= "";
		КонецЕсли;
		
		ТекущиеДанныеГосНомера = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьДанныеРегистрационногоЗнака(ТекущийОбъект.Ссылка, ТекущаяДата());
		РегистрационныйЗнак_Изменился 		 		= ВРЕГ(СокрЛП(РегистрационныйЗнак))			<> СокрЛП(ТекущиеДанныеГосНомера.РегистрационныйЗнак);
		РегистрационныйЗнак_Номер_Изменился  		= ВРЕГ(СокрЛП(РегистрационныйЗнак_Номер))	<> СокрЛП(ТекущиеДанныеГосНомера.РегистрационныйЗнак_Номер);
		РегистрационныйЗнак_Регион_Изменился 		= ВРЕГ(СокрЛП(РегистрационныйЗнак_Регион))	<> СокрЛП(ТекущиеДанныеГосНомера.РегистрационныйЗнак_Регион);
		РегистрационныйЗнак_Произвольный_Изменился 	= СокрЛП(РегистрационныйЗнак_Произвольный) 	<> СокрЛП(ТекущиеДанныеГосНомера.РегистрационныйЗнак_Произвольный);
		
		Если РегистрационныйЗнак_Изменился 
			или РегистрационныйЗнак_Номер_Изменился 
			или РегистрационныйЗнак_Регион_Изменился 
			или  РегистрационныйЗнак_Произвольный_Изменился Тогда
			
			ДанныеДляЗаписиВРегистр = Новый Структура;
			ДанныеДляЗаписиВРегистр.Вставить("Период"							, ТекущаяДата());
			ДанныеДляЗаписиВРегистр.Вставить("ТранспортноеСредство"				, ТекущийОбъект.Ссылка);
			
			ДанныеДляЗаписиВРегистр.Вставить("РегистрационныйЗнак"							, РегистрационныйЗнак);
			ДанныеДляЗаписиВРегистр.Вставить("РегистрационныйЗнак_Номер"					, РегистрационныйЗнак_Номер);
			ДанныеДляЗаписиВРегистр.Вставить("РегистрационныйЗнак_Регион"					, РегистрационныйЗнак_Регион);
			ДанныеДляЗаписиВРегистр.Вставить("РегистрационныйЗнак_Произвольный"				, РегистрационныйЗнак_Произвольный);
			
			РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ЗаписатьДанныеРегистрационныхЗнаковВРегистр(ДанныеДляЗаписиВРегистр);
			
			ОбновитьДанныеРегистрационногоНомера();
			
		КонецЕсли;
		
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не РегистрационныйЗнак_Произвольный Тогда
		РегистрационныйЗнак	= ВРЕГ(СокрЛП(РегистрационныйЗнак_Номер)+СокрЛП(РегистрационныйЗнак_Регион));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если РегистрационныйЗнак_Изменен 
		Или РегистрационныйЗнак_Произвольный_Изменен
		Или РегистрационныйЗнак_Номер_Изменен 
		Или РегистрационныйЗнак_Регион_Изменен Тогда
		
		Оповестить("ОбновитьРегистрационныеНомера");
		
		РегистрационныйЗнак_Изменен 				= Ложь;
		РегистрационныйЗнак_Номер_Изменен 			= Ложь;
		РегистрационныйЗнак_Регион_Изменен 			= Ложь;
		РегистрационныйЗнак_Произвольный_Изменен 	= Ложь;
	
	КонецЕсли;
		
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _ЗаполнитьСписокВодителей()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РолиСотрудниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	               |	CW_РолиСотрудниковОрганизацийСрезПоследних.РольСотрудника КАК РольСотрудника
	               |ИЗ
	               |	РегистрСведений.CW_РолиСотрудниковОрганизаций.СрезПоследних КАК CW_РолиСотрудниковОрганизацийСрезПоследних
	               |ГДЕ
	               |	CW_РолиСотрудниковОрганизацийСрезПоследних.РольСотрудника = &РольСотрудника";
	
	РольСотрудника = ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Водитель");
	Запрос.УстановитьПараметр("РольСотрудника", РольСотрудника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	мВодители = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Элементы.Водитель.СписокВыбора.ЗагрузитьЗначения(мВодители);
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаСервере
Процедура ЗаполнитьПоказателиНормРасходаТопливаНаСервере()
	
	Если Не ПрименяютсяНормативыРасходаТоплива Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПоказателиРасчетаРасходаТоплива.Ссылка КАК Показатель,
		|	CW_ПоказателиРасчетаРасходаТоплива.БуквенныйКод КАК БуквенныйКод,
		|	CW_ПоказателиРасчетаРасходаТоплива.Описание КАК Описание
		|ПОМЕСТИТЬ ВТ_ДоступныеПоказатели
		|ИЗ
		|	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК CW_ПоказателиРасчетаРасходаТоплива
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ &УчитыватьПогрешностьИзмеренияОстаткаТоплива
		|				ТОГДА CW_ПоказателиРасчетаРасходаТоплива.Ссылка <> ЗНАЧЕНИЕ(Справочник.CW_ПоказателиРасчетаРасходаТоплива.ПогрешностьИзмеренияОстаткаТоплива)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И CW_ПоказателиРасчетаРасходаТоплива.УказываетсяВНастройках
		|	И НЕ CW_ПоказателиРасчетаРасходаТоплива.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.Период КАК Период,
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ПоказательРасчетаРасходаТоплива КАК ПоказательРасчетаРасходаТоплива,
		|	CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних.ЗначениеПоказателя КАК ЗначениеПоказателя
		|ПОМЕСТИТЬ ВТ_СрезЗначений
		|ИЗ
		|	РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.СрезПоследних(
		|			&ДатаСреза,
		|			ПоказательРасчетаРасходаТоплива В
		|					(ВЫБРАТЬ
		|						ВТ_ДоступныеПоказатели.Показатель КАК Показатель
		|					ИЗ
		|						ВТ_ДоступныеПоказатели КАК ВТ_ДоступныеПоказатели)
		|				И ОбъектРасчета = &ОбъектРасчета) КАК CW_ЗначенияПоказателейНормРасходаТопливаСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПоказательРасчетаРасходаТоплива
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_СрезЗначений.Период, НЕОПРЕДЕЛЕНО) КАК Период,
		|	ВТ_ДоступныеПоказатели.Показатель КАК ПоказательРасчетаРасходаТоплива,
		|	ВТ_ДоступныеПоказатели.БуквенныйКод КАК БуквенныйКод,
		|	ВТ_ДоступныеПоказатели.Описание КАК Описание,
		|	ЕСТЬNULL(ВТ_СрезЗначений.ЗначениеПоказателя, 0) КАК ЗначениеПоказателя,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_СрезЗначений.ЗначениеПоказателя, 0) = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отображать
		|ИЗ
		|	ВТ_ДоступныеПоказатели КАК ВТ_ДоступныеПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезЗначений КАК ВТ_СрезЗначений
		|		ПО ВТ_ДоступныеПоказатели.Показатель = ВТ_СрезЗначений.ПоказательРасчетаРасходаТоплива";
	
	Запрос.УстановитьПараметр("ДатаСреза"									, ТекущаяДата());
	Запрос.УстановитьПараметр("ОбъектРасчета"								, Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидтранспортногоСредства"					, Объект.ВидТС);
	Запрос.УстановитьПараметр("УчитыватьПогрешностьИзмеренияОстаткаТоплива"	, ПолучитьФункциональнуюОпцию("CW_УчитыватьПогрешностьИзмеренияОстаткаТоплива"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПоказателиНормРасходаТоплива.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаСервере
Процедура ПолучитьДействующуюФрмулуНормРасходаТранспортногоСредства()
	
	ПараметрыФормулы = CW_УчетСобственногоТранспортаСервер.ПолучитьДействующуюФормулуНормрасходатранспортныхСредств(ТекущаяДата(), Объект.Ссылка);
	
	Если ПараметрыФормулы = Неопределено Тогда
		ФормулаРасчетаНормыРасходаТоплива = Объект.Модель.ФормулаРасчетаНормыРасходаТоплива;
		ПрименяетсяФормулаМодели = Истина;
	Иначе
		ФормулаРасчетаНормыРасходаТоплива   = ПараметрыФормулы.ФормулаРасчетаНормыРасходаТоплива;
		ДействуетДо 						= ПараметрыФормулы.ДействуетДо;
		ПрименяетсяФормулаМодели = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура _НачальноеЗаполнение()
	// --- 
	
	Если (Объект.Ссылка.Пустая()) Тогда
		
		Объект.ГодВыпуска = Год(ТекущаяДата());
		
		УстановитьТипТарнспортногоСредстваИзНастроекПользоватлея();
			
		ПриИзмененииТипаТранспортногоСредстваНаСервере();
	
	Иначе
		
		Если ИспользуетсяБлокСобственногоТранспорта тогда

			ЕстьПутевыеЛистыПоТранспортномуСредству = ПроверитьНаличиеПутевыхЛистов();
			
			ЗаполнитьТекущиеСостояние();
			
			_ЗаполнитьСписокВодителей();
			
			_ОтборПараметров();
			
			Если ПрименяютсяНормативыРасходаТоплива Тогда
				
				ПолучитьДействующуюФрмулуНормРасходаТранспортногоСредства();
			
				ЗаполнитьПоказателиНормРасходаТопливаНаСервере();
				
				УстановитьСнятьОтборПоказателей();
				
				ОбновитьОтображениеКнопки();
				
			КонецЕсли;
			
			
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипТарнспортногоСредстваИзНастроекПользоватлея()
	
	ТипТранспортногоСредства = Неопределено;
	Если Объект.ВидТС = Перечисления.CW_ВидыТС.Автомобиль Тогда
		ТипТранспортногоСредства = ОсновнойТипДляТягача;
	ИначеЕсли  Объект.ВидТС = Перечисления.CW_ВидыТС.Прицеп Тогда
		ТипТранспортногоСредства = ОсновнойТипДляПрицепа;
	ИначеЕсли  Объект.ВидТС = Перечисления.CW_ВидыТС.ДополнительноеОборудование Тогда
		ТипТранспортногоСредства = ОсновнойТипДляДопОборудования;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипТранспортногоСредства) Тогда
		Если Объект.ТипТранспортногоСредства.ВидТС <> Объект.ВидТС  Тогда
			Объект.ТипТранспортногоСредства = Неопределено;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТипТранспортногоСредства) Тогда
			Объект.ТипТранспортногоСредства = ТипТранспортногоСредства;
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеСостояние()
	
	//ТекущийСтатус
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СостоянияТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	CW_СостоянияТССрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.CW_СостоянияТС.СрезПоследних(, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_СостоянияТССрезПоследних";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство"	, Объект.Ссылка);
	
	Выборка = запрос.Выполнить().Выбрать();
	
	ТекущийСтатус = Справочники.CW_СостоянияТС.ПустаяСсылка();
	Если Выборка.Следующий() тогда
		ТекущийСтатус =  Выборка.Состояние;
	КонецЕсли;

	//ТекущийПробег
	//ТекущийПробегСГрузом
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПробегТСОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	СУММА(CW_ПробегТСОбороты.ПробегОборот) КАК Пробег,
	               |	СУММА(CW_ПробегТСОбороты.ПробегСГрузомОборот) КАК ПробегСГрузом
	               |ИЗ
	               |	РегистрНакопления.CW_ПробегТС.Обороты(, , , ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ПробегТСОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ПробегТСОбороты.ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство"	, Объект.Ссылка);
	
	Выборка = запрос.Выполнить().Выбрать();
	                                                           
	ТекущийПробег 			= 0;
	ТекущийПробегСГрузом 	= 0;
	Если Выборка.Следующий() тогда
		ТекущийПробег 			=  Выборка.Пробег;
		ТекущийПробегСГрузом 	=  Выборка.ПробегСГрузом;
	КонецЕсли;
	
	//	ТекущийОстатокТоплива
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТопливоТСОстатки.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	CW_ТопливоТСОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.CW_ТопливоТС.Остатки(, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ТопливоТСОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ТопливоТСОстатки.ТранспортноеСредство,
	               |	CW_ТопливоТСОстатки.КоличествоОстаток";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство"	, Объект.Ссылка);
	
	Выборка = запрос.Выполнить().Выбрать();
	                                                           
	ТекущийОстатокТоплива = 0;
	Если Выборка.Следующий() тогда
		ТекущийОстатокТоплива 	=  Выборка.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеПутевыхЛистов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ПутевойЛист.Ссылка
	|ИЗ
	|	Документ.CW_ПутевойЛист КАК CW_ПутевойЛист
	|ГДЕ
	|	CW_ПутевойЛист.ТранспортноеСредство = &ТранспортноеСредство
	|	И CW_ПутевойЛист.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.Ссылка);
	
	Результат = Запрос.Выполнить(); 
	
	Возврат Не Результат.Пустой();
	
КонецФункции
 
&НаСервере
Процедура _СписокВыбораОсновногоТоплива()
	// --- 
	
	Если (ЗначениеЗаполнено(Объект.Модель)) Тогда
		
		мВидыТопливаМодели = ПолучитьВидыТопливаМоделиТС();
		
		Элементы.Топливо.СписокВыбора.ЗагрузитьЗначения(мВидыТопливаМодели);

	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 
&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	ВидТСТягач 						= ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Автомобиль");
	ВидТСДополнительноеОборудование = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ДополнительноеОборудование");
	ВидТСПустаяСсылка 				= ПредопределенноеЗначение("Перечисление.CW_ВидыТС.ПустаяСсылка");

	//Элементы.ВидТС.ТолькоПросмотр 			= ЕстьПутевыеЛистыПоТранспортномуСредству;
	//Элементы.Модель.ТолькоПросмотр 			= ЕстьПутевыеЛистыПоТранспортномуСредству;
	Элементы.НомерКПП.Видимость 			= Объект.ВидТС 	= ВидТСТягач;
	Элементы.СтраницаПоУмолчанию.Видимость 	= Объект.ВидТС 	= ВидТСТягач;
	Элементы.СтраницаНормыРасхода.Видимость = Объект.ВидТС  = ВидТСТягач и ПрименяютсяНормативыРасходаТоплива;
	
	Элементы.СтраницаПутевыеЛисты.Видимость = НЕ (Объект.ВидТС = ВидТСПустаяСсылка или Объект.ВидТС = ВидТСДополнительноеОборудование);
	Элементы.ГруппаРегНомер.Видимость 		= НЕ (Объект.ВидТС = ВидТСПустаяСсылка или Объект.ВидТС = ВидТСДополнительноеОборудование);
	
	Элементы.ГруппаПоказатели.Видимость 	= ПоказателиНормРасходаТоплива.Количество() > 0 
	и ИспользуютсяПоказателиТранспортногоСредстваОтдельноОтМодели
	и Не Объект.Модель.ТопливныйБакОтсутствует; 
	
	Элементы.ГруппаФормула.Видимость 			= ПрименяютсяНормативыРасходаТоплива;
	Элементы.ДатаОкончания.Видимость 			= Не ПрименяетсяФормулаМодели и ПрименяютсяНормативыРасходаТоплива;
	
	Элементы.ГруппаПараметрыТС.Видимость 	= Объект.Принадлежность = 2;
	Элементы.Контрагент.Видимость 			= Объект.Принадлежность < 2;
	
	//Элементы.Группа6.Доступность 			= НЕ Объект.Принадлежность = 2;
	
	ПроизвольныйРегистрационныйЗнакПриИзмененииНаСервере();
	ИзменитьПодсказкуВводаРегистрационногоЗнака();
	
КонецПроцедуры
 
&НаСервере
Процедура _ОтборПараметров()

	Если Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Автомобиль") Тогда
		ВидТранспортногоСредства = 0;
	ИначЕесли  Объект.ВидТС = ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Прицеп") Тогда
		ВидТранспортногоСредства = 1;
	Иначе
		ВидТранспортногоСредства = -1;
	КонецЕсли;
	
	ПараметрыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТранспортноеСредство"				, Объект.Ссылка);
	//Временно, до удаления соответствующего параметра ТС
	ПараметрыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПараметрТранпортногоСредстваРегЗнак"	, ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.РегистрационныйЗнак);
	
	
	
	ДокументыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТранспортноеСредство"	, Объект.Ссылка);
	ДокументыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НеДействует"				,?(ДокументыТС_ПоказыватьНеАктуальные,Неопределено,Ложь));
	
	ПутевыеЛистыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидТранспортногоСредства"	, ВидТранспортногоСредства);
	ПутевыеЛистыТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗначениеОтбора"			, Объект.Ссылка);
	
	ОборудованиеТС.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТранспортноеСредство"	, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьОтборПоказателей()
	
	Если ОтображатьВсеПоказатели Тогда
		ТекущийОтбор = Неопределено;
	Иначе
		ТекущийОтбор = Новый ФиксированнаяСтруктура("Отображать", Истина)
	КонецЕсли;
		
	Элементы.ПоказателиНормРасходаТоплива.ОтборСтрок = ТекущийОтбор;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	ПриИзмененииМоделиТС();	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииМоделиТС()
	
	ОбновитьПодсказкуТоплива();
	ПриИзмененииВидаТСНаСервере();
	ЗаполнитьТаблицуХарактеристикМодели();

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПереключитьОтображениеНеактивныхДокументов(Команда)
	
	ДокументыТС_ПоказыватьНеАктуальные = НЕ ДокументыТС_ПоказыватьНеАктуальные;
	
	ОбработатьОтображениеКнопкиАкутальныхДокументов();
	
	_ОтборПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтображениеКнопкиАкутальныхДокументов()
	
	Элементы.ДокументыТСПереключитьОтображениеНеактивныхДокументов.Пометка = ДокументыТС_ПоказыватьНеАктуальные;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидыТопливаМоделиТС()
	
	Возврат Объект.Модель.ВидыТоплива.ВыгрузитьКолонку("Топливо");
	
КонецФункции

&НаКлиенте
Процедура ТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	_СписокВыбораОсновногоТоплива();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПоказателиПослеЗакрытияФормыВыбора(РезультатВыбора, Параметр) Экспорт

	ЗаполнитьПоказателиНормРасходаТопливаНаСервере();
	
	Если ИндексСтроки <> Неопределено Тогда
		СтрокаТаблицы = ПоказателиНормРасходаТоплива[ИндексСтроки];
		Элементы.ПоказателиНормРасходаТоплива.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
		ИндексСтроки = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидТСПриИзменении(Элемент)
	
	ПриИзмененииВидаТСНаСервере();
	ИзменитьПодсказкуВводаРегистрационногоЗнака();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаТСНаСервере()
	
	УстановитьТипТарнспортногоСредстваИзНастроекПользоватлея();
	
	ПриИзмененииТипаТранспортногоСредстваНаСервере();
	
	ЗаполнитьПоказателиНормРасходаТопливаНаСервере();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПоказатель(Команда)
	
	СтрокаПоказателя = Элементы.ПоказателиНормРасходаТоплива.ТекущиеДанные;
	
	Если Не СтрокаПоказателя = Неопределено Тогда
		ИндексСтроки = ПоказателиНормРасходаТоплива.Индекс(СтрокаПоказателя);
		
		ОткрытьФормуСпискаПоказателя(СтрокаПоказателя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиНормРасходаТопливаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаПоказателя = Элементы.ПоказателиНормРасходаТоплива.ТекущиеДанные;
	
	Если Не СтрокаПоказателя = Неопределено Тогда
		ИндексСтроки = ПоказателиНормРасходаТоплива.Индекс(СтрокаПоказателя);
		
		ОткрытьФормуСпискаПоказателя(СтрокаПоказателя);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура  ОткрытьФормуСпискаПоказателя(СтрокаПоказателя)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектРасчета"					, Объект.Ссылка);
	ПараметрыОтбора.Вставить("ПоказательРасчетаРасходаТоплива"	, СтрокаПоказателя.ПоказательРасчетаРасходаТоплива);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор" , ПараметрыОтбора);

	ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ОбновитьПоказателиПослеЗакрытияФормыВыбора", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ЗначенияПоказателейНормРасходаТоплива.Форма.ФормаРедактированияСписка",СтруктураПараметров,ЭтаФорма,,,,ОповещениеПриЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеПоказатели(Команда)
	
	ОтображатьВсеПоказатели = не ОтображатьВсеПоказатели;
	
	УстановитьСнятьОтборПоказателей();
	ОбновитьОтображениеКнопки();

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ТранспортноеСредство", Объект.Ссылка));
	
	ОткрытьФорму("РегистрСведений.CW_ПараметрыТС.ФормаСписка",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ЗначенияЗаполнения = новый Структура("Владелец", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.CW_ДокументыТС.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);	
 
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеТСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ЗначенияЗаполнения = новый Структура("ТранспортноеСредство", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("РегистрСведений.CW_ДополнительноеОборудованиеТС.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	Если Объект.Принадлежность  = 2 Тогда
		//Отбор из по роли сотрудник атолько для совбственных 
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметровФормы 	= Новый Структура;
		СтруктураПараметровФормы.Вставить("РольСотрудника"				, ПредопределенноеЗначение("Справочник.CW_РолиСотрудников.Водитель"));
		СтруктураПараметровФормы.Вставить("Организация"					, Неопределено);
		СтруктураПараметровФормы.Вставить("ОтборПоОрганизации"			, Ложь);
		СтруктураПараметровФормы.Вставить("ВозможностьСоздаватьЗаписи"	, Ложь);
		
		ДополнительныйПараметр 		= Новый Структура("Реквизит", "Водитель");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВодителя",ЭтотОбъект, ДополнительныйПараметр);
		
		ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораСотрудникаДляРоли",СтруктураПараметровФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		СписокЗначенийВыбора = Новый СписокЗначений;
		Если ПолучитьСписокСотрудников(СписокЗначенийВыбора) Тогда
			СтандартнаяОбработка = Ложь;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораВодителя",ЭтотОбъект);
			
			ПараметрыФормыВыбора = Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, истина);
			
			Форма = ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора",ПараметрыФормыВыбора,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			ПользовательскийОтбор = Форма.Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки); //Если вам известен идентификатор, указываете здесь. Но можно не заполнять
			ПользовательскийОтбор.Элементы.Очистить();  			
			
			ОтборВладелец = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборВладелец.Использование = Истина;
			ОтборВладелец.ИдентификаторПользовательскойНастройки = "КонтактныеЛица";  
			ОтборВладелец.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
			ОтборВладелец.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
			ОтборВладелец.ПравоеЗначение	= СписокЗначенийВыбора;
			
		Конецесли;
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСотрудников(ДанныеВыбора)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_КонтактыеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		               |ИЗ
		               |	Справочник.CW_КонтактыеЛица КАК CW_КонтактыеЛица
		               |ГДЕ
		               |	CW_КонтактыеЛица.Владелец = &Владелец
		               |	И НЕ CW_КонтактыеЛица.Неактивный
		               |	И НЕ CW_КонтактыеЛица.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Владелец", Объект.Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.ФизическоеЛицо);
		КонецЦикла;
		
		Возврат ДанныеВыбора.Количество() > 0;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораВодителя(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		Объект.ОсновнойВодитель = Ответ;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаРасчетаНормыРасходаТопливаНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не ПрименяетсяФормулаМодели Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ПараметрыОтбора 	= Новый Структура("ТранспортноеСредство", Объект.Ссылка);
		СтруктураПараметров = Новый Структура("Отбор", ПараметрыОтбора);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыСписка", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств.ФормаСписка",СтруктураПараметров,ЭтаФорма,,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыСписка(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	// --- 
	
	ПолучитьДействующуюФрмулуНормРасходаТранспортногоСредства();
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьФормулу(Команда)
	
	ПараметрыОтбора 	= Новый Структура("ТранспортноеСредство", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыСписка", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств.ФормаСписка",СтруктураПараметров,ЭтаФорма,,,,ОбработкаОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежностьПриИзменении(Элемент)
	
	ОбработатьВидимостьЭлементовПоПринадлежностиТС();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьЭлементовПоПринадлежностиТС()
	
	Если Объект.Принадлежность = 2 тогда
		Объект.Контрагент = Неопределено;
	КонецЕсли;
	
	_УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуХарактеристикМодели()
	
	Если Не ЗначениеЗаполнено(Объект.Модель) тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Модель.ТипТранспортногоСредства) тогда
		Возврат;
	КонецЕсли;
	
	ДеревоХарактеристик  = РеквизитФормыВЗначение("ХарактеристикиМодели");
	
	ДеревоХарактеристик.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_МоделиТС.ТипТранспортногоСредства.НаличиеКузоваИлиЦистерны КАК НаличиеКузоваИлиЦистерны,
	               |	CW_МоделиТС.ТипТранспортногоСредства.НаличиеРефрижираторнойУстановки КАК НаличиеРефрижираторнойУстановки,
	               |	CW_МоделиТС.ТипКолеснойБазы КАК Характеристики__Тип_колесной_базы,
	               |	CW_МоделиТС.ВидЗагрузки КАК Характеристики__Вид_загрузки,
	               |	CW_МоделиТС.Высота КАК Характеристики__Высота,
	               |	CW_МоделиТС.Длина КАК Характеристики__Длина,
	               |	CW_МоделиТС.Ширина КАК Характеристики__Ширина,
	               |	CW_МоделиТС.Вес КАК Характеристики__Вес,
	               |	CW_МоделиТС.Грузоподъемность КАК Характеристики__Грузоподъемность,
	               |	CW_МоделиТС.Объем КАК Характеристики__Объем,
	               |	CW_МоделиТС.ТемператураПредставление КАК Температурынй_режим__Температура,
	               |	CW_МоделиТС.ТипДвигателяТС КАК Двигатель__Тип,
	               |	CW_МоделиТС.МодельДвигателя КАК Двигатель__Модель,
	               |	CW_МоделиТС.ОбъемДвигателя КАК Двигатель__Объем,
	               |	CW_МоделиТС.МощностьДвигателяКВТ КАК Двигатель__Мощность_кВТ,
	               |	CW_МоделиТС.МощностьДвигателяЛС КАК Двигатель__Мощность_ЛС,
	               |	НЕ CW_МоделиТС.ТопливныйБакОтсутствует КАК Топливный_Бак__Наличие,
	               |	CW_МоделиТС.ОбъемТопливногоБака КАК Топливный_Бак__Объем
	               |ИЗ
	               |	Справочник.CW_МоделиТС КАК CW_МоделиТС
	               |ГДЕ
	               |	CW_МоделиТС.Ссылка = &МодельТС";
	
	Запрос.УстановитьПараметр("МодельТС", Объект.Модель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураХарактеристик = новый Структура;
		СтруктураХарактеристик.Вставить("Характеристики__Тип_колесной_базы", "Тип колесной базы");
		СтруктураХарактеристик.Вставить("Характеристики__Вес", "Вес, т.");
		
		Если Выборка.НаличиеКузоваИлиЦистерны Тогда
			СтруктураХарактеристик.Вставить("Характеристики__Вид_загрузки"		, "Вид загрузки");
			СтруктураХарактеристик.Вставить("Характеристики__Грузоподъемность"	, "Грузоподъемность, т.");
			СтруктураХарактеристик.Вставить("Характеристики__Объем"				, "Объем, м.куб.");
			СтруктураХарактеристик.Вставить("Характеристики__Высота"			, "Высота, м." );
			СтруктураХарактеристик.Вставить("Характеристики__Длина"				, "Длина, м.");
			СтруктураХарактеристик.Вставить("Характеристики__Ширина"			, "Ширина, м.");
		КонецЕсли;
		
		Если Выборка.НаличиеРефрижираторнойУстановки тогда
			СтруктураХарактеристик.Вставить("Температурынй_режим__Температура", "Диапазон температур, град. С");
		КонецЕсли;
		
		Если Выборка.Двигатель__Тип <> Перечисления.CW_ТипыДвигателейТС.Отсутствует Тогда
			СтруктураХарактеристик.Вставить("Двигатель__Тип"		, "Тип");
			СтруктураХарактеристик.Вставить("Двигатель__Модель"		, "Модель");
			
			Если Выборка.Двигатель__Тип <> Перечисления.CW_ТипыДвигателейТС.Электрический Тогда
				СтруктураХарактеристик.Вставить("Двигатель__Объем"	, "объем, см.куб");
			КонецЕсли;
			
			СтруктураХарактеристик.Вставить("Двигатель__Мощность_кВТ"	, "Мощность, к.Вт");
			СтруктураХарактеристик.Вставить("Двигатель__Мощность_ЛС"	, "Мощность, л.с.");
			
			Если Выборка.Топливный_бак__Наличие Тогда
				СтруктураХарактеристик.Вставить("Топливный_бак__Объем"	, "Объем, л.");
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ЭлементСтркутуры из СтруктураХарактеристик Цикл
			
			Строки 			= СтрЗаменить(ЭлементСтркутуры.Ключ,"__",Символы.ПС);
			МассивСтрок 	= Новый Массив;
			Для Счетчик 	= 1 По СтрЧислоСтрок(Строки) Цикл
				МассивСтрок.Добавить(СтрПолучитьСтроку(Строки,Счетчик));
			КонецЦикла; 
			
			Если МассивСтрок.Количество() = 2 Тогда 
				ГруппаХарактеристик 	= МассивСтрок[0];
			Иначе 
				Продолжить;
			КонецЕсли;

			ГруппаХарактеристик 	= СтрЗаменить(ГруппаХарактеристик , "_", " ");
			Значение 				= Выборка[ЭлементСтркутуры.Ключ];
			
			Если ТипЗнч(Значение) = Тип("Число") Тогда
				Значение = Формат(Значение, "ЧДЦ=3");
			Иначе
				Значение = СокрЛП(Значение);
			КонецЕсли;
			
			//Заполнение дерева
			ГруппаСтрока = ДеревоХарактеристик.Строки.Найти(ГруппаХарактеристик,"тРодитель");
			Если ГруппаСтрока  = Неопределено Тогда
				ГруппаСтрока = ДеревоХарактеристик.Строки.Добавить();
				ГруппаСтрока.тРодитель 		= ГруппаХарактеристик;
				ГруппаСтрока.Характеристика = ГруппаХарактеристик;
				ГруппаСтрока.ТипЭлемента 	= 0;
			КонецЕсли;
			
			СтрокаХарактеристка =  ГруппаСтрока.Строки.Добавить();
			СтрокаХарактеристка.тРодитель 		= ГруппаХарактеристик;
			СтрокаХарактеристка.Характеристика  = ЭлементСтркутуры.Значение;
			СтрокаХарактеристка.Значение 		= Значение;
			СтрокаХарактеристка.ТипЭлемента 	= 3;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДеревоХарактеристик, "ХарактеристикиМодели");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьХарактеристики(Команда)
	
	ЗаполнитьТаблицуХарактеристикМодели();

КонецПроцедуры

&НаКлиенте
Процедура ТипТранспортногоСредстваПриИзменении(Элемент)
	
	ПриИзмененииТипаТранспортногоСредстваНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииТипаТранспортногоСредстваНаСервере()

	Если Объект.ТипТранспортногоСредства <> Объект.Модель.ТипТранспортногоСредства Тогда
		Объект.Модель = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПодсказкуВводаРегистрационногоЗнака()
	
	Если Не РегистрационныйЗнак_Произвольный  Тогда
		Если Объект.ВидТС = Перечисления.CW_ВидыТС.Автомобиль тогда
			ТекстПодсказкиВводарегистрационногоЗнака= "А777АА";
		ИначеЕсли Объект.ВидТС = Перечисления.CW_ВидыТС.Прицеп тогда 
			ТекстПодсказкиВводарегистрационногоЗнака= "АА7777";
		КонецЕсли;
	Иначе
		ТекстПодсказкиВводарегистрационногоЗнака = "";
	КонецЕсли;

	Элементы.РегистрационныйЗнак_Номер.ПодсказкаВвода = ТекстПодсказкиВводарегистрационногоЗнака;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТранспортногоСредстваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидТС) Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран Вид транспортного средства!";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Поле 			= "ВидТС";
	    Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ВидТС) Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран Вид транспортного средства!";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Поле 			= "ВидТС";
	    Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипТранспортногоСредства) Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран Тип транспортного средства!";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Поле 			= "ТипТранспортногоСредства";
	    Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиНормРасходаТопливаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПрицепНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначенияОтбора = Новый Структура;
	ЗначенияОтбора.Вставить("ВидТС", ПредопределенноеЗначение("Перечисление.CW_ВидыТС.Прицеп"));
	Если ЗначениеЗаполнено(Объект.Контрагент) и УстанавливатьОтборПрицепаПоВладельцу Тогда
		ЗначенияОтбора.Вставить("Контрагент",Объект.Контрагент);
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, Отбор",истина, Ложь, ЗначенияОтбора);
	
	ОткрытьФорму("Справочник.CW_ТранспортныеСредства.Форма.ФормаВыбора",ПараметрыФормы,Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПроизвольныйРегистрационныйЗнакПриИзмененииНаСервере()
	
	Элементы.ГруппаРегистрационныйЗнакРФ.Видимость		= Не РегистрационныйЗнак_Произвольный;
	Элементы.ГруппаРегистрационныйЗнакЕвро.Видимость 	= РегистрационныйЗнак_Произвольный;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйРегистрационныйЗнакПриИзменении(Элемент)
	
	РегистрационныйЗнак_Произвольный_Изменен 	= Истина;
	Модифицированность 							= истина;
	
	ПроизвольныйРегистрационныйЗнакПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте                                                                                	
Процедура РегистрационныйЗнакПриИзменении(Элемент)
	
	РегистрационныйЗнак_Изменен = истина;
	Модифицированность 			= истина; 
	
	РегистрационныйЗнакПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнак_НомерОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка 				= ложь;
	Модифицированность 					= истина;
	РегистрационныйЗнак_Номер 			= Текст;
	НомерКорректен 						= ПровериьДанные(Текст, истина);
	РегистрационныйЗнак_Номер_Изменен 	= Истина;
	
	ОбновитьЦветТекста();
	РегистрационныйЗнакПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйЗнак_РегионОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка 				= ложь;
	Модифицированность 					= истина;
	РегистрационныйЗнак_Регион  		= Текст;
	РегионКорректен 					= ПровериьДанные(Текст, ложь);
	РегистрационныйЗнак_Регион_Изменен 	= Истина;
	
	ОбновитьЦветТекста();
	РегистрационныйЗнакПриИзмененииНаСервере();
	
КонецПроцедуры   

&НаСервере
Процедура РегистрационныйЗнакПриИзмененииНаСервере()

	Если Объект.РедактироватьНаименование Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрационныйЗнак_Произвольный Тогда
		РегистрационныйЗнак_Текст = СокрЛП(РегистрационныйЗнак);	
	Иначе
		РегистрационныйЗнак_Текст = СокрЛП(РегистрационныйЗнак_Номер) + СокрЛП(РегистрационныйЗнак_Регион);	
	КонецЕсли;    
	
	Объект.Наименование = СокрЛП(РегистрационныйЗнак_Текст);
	
КонецПроцедуры


&наСервере
Процедура ОбновитьЦветТекста()
	
	Элементы.РегистрационныйЗнак_Номер.ЦветТекста 	= ?(НомерКорректен	, новый Цвет, ЦветаСтиля.ЦветОтрицательногоЧисла);
	Элементы.РегистрационныйЗнак_Регион.ЦветТекста 	= ?(РегионКорректен	, новый Цвет, ЦветаСтиля.ЦветОтрицательногоЧисла);
	
КонецПроцедуры

&НаСервере
Функция ПровериьДанные(Текст, Флаг)
	 Возврат  Справочники.CW_ТранспортныеСредства.ПроверитьКорректностьНомера(Текст, Флаг);
КонецФункции

&НаКлиенте
Процедура НадписьПоказатьИсториюНажатие(Элемент)
	
	
	СтруктураОтбора = Новый Структура("ТранспортноеСредство", Объект.Ссылка);
	ПараметрыФормыСписка = Новый Структура("Отбор", СтруктураОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыСпискаРегистра", ЭтаФорма);
	
	ОткрытьФорму("РегистрСведений.CW_РегистрацонныеЗнакиАвтомобилей.ФормаСписка", ПараметрыФормыСписка,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСпискаРегистра(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ОбновитьДанныеРегистрационногоНомера();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРегистрационногоНомера()
	
	ДанныеРегистрационногоЗнака = РегистрыСведений.CW_РегистрацонныеЗнакиАвтомобилей.ПолучитьДанныеРегистрационногоЗнака(Объект.Ссылка);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеРегистрационногоЗнака); 
	
	НомерКорректен  			= ПровериьДанные(РегистрационныйЗнак_Номер	, Истина);
	РегионКорректен 			= ПровериьДанные(РегистрационныйЗнак_Регион	, ложь);
	
	ОбновитьЦветТекста();
	
КонецПроцедуры

&НаКлиенте
Процедура ТопливоРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Модель) Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбрана модель транспортного средства";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Поле 			= "Модель";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

#КонецОбласти
